In [217]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [218]:
import warnings
warnings.filterwarnings('ignore')

In [219]:
#Load the dataset
df = pd.read_csv('Fraud_check.csv')
df

,Undergrad,Marital.Status,Taxable.Income,City.Population,Work.Experience,Urban
0,NO,Single,68833,50047,10,YES
1,YES,Divorced,33700,134075,18,YES
2,NO,Married,36925,160205,30,YES
3,YES,Single,50190,193264,15,YES
4,NO,Married,81002,27533,28,NO
...,...,...,...,...,...,...
595,YES,Divorced,76340,39492,7,YES
596,YES,Divorced,69967,55369,2,YES
597,NO,Divorced,47334,154058,0,YES
598,YES,Married,98592,180083,17,NO
599,NO,Divorced,96519,158137,16,NO

In [220]:
#check the dimensional
df.shape

(600, 6)

In [221]:
#check the data Types
df.dtypes

Undergrad          object
Marital.Status     object
Taxable.Income      int64
City.Population     int64
Work.Experience     int64
Urban              object
dtype: object

In [222]:
#check the columns
df.columns

Index(['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'],
      dtype='object')

In [223]:
#creating a seperate columns which has TaxableIncome has <=30000 metion as Risky else Good.
new_col = []
for i in df['Taxable.Income']:
    if i <=30000:
        new_col.append('Risky')
    else:
        new_col.append('Good')

In [224]:
df_new_col = pd.DataFrame(new_col)

In [225]:
#seperating the objects and integer
df_object_data = df.select_dtypes('object')
df_object_integer = df.select_dtypes('int64')

In [226]:
#Data Transformation
from sklearn.preprocessing import LabelEncoder
for i in df_object_data:
    LE = LabelEncoder()
    df_object_data[i] = LE.fit_transform(df_object_data[i])

In [227]:
df_object_data

     Undergrad  Marital.Status  Urban
0            0               2      1
1            1               0      1
2            0               1      1
3            1               2      1
4            0               1      0
..         ...             ...    ...
595          1               0      1
596          1               0      1
597          0               0      1
598          1               1      0
599          0               0      0

[600 rows x 3 columns]

In [228]:
#NEW Data Frame
df_new_dataframe = pd.concat([df_object_integer,df_object_data],axis =1)

In [229]:
#Data transformation
from sklearn.preprocessing import StandardScaler
SS = StandardScaler()
df_new_dataframe1 = SS.fit_transform(df_new_dataframe)

In [230]:
df_new_dataframe2 = pd.DataFrame(df_new_dataframe1,columns=['Undergrad', 'Marital.Status', 'Taxable.Income', 'City.Population',
       'Work.Experience', 'Urban'])

In [231]:
#droping the Taxable.Income columns
df_new_dataframe3 = df_new_dataframe2.drop(df_new_dataframe2.columns[2],axis =1)

In [232]:
df_new_dataframe3

     Undergrad  Marital.Status  City.Population  Work.Experience     Urban
0     0.520362       -1.178521        -1.040833         1.160800  0.993355
1    -0.821464        0.508500         0.960769        -1.274445  0.993355
2    -0.698292        1.033109        -1.040833        -0.056822  0.993355
3    -0.191666        1.696831         0.960769         1.160800  0.993355
4     0.985129       -1.630532        -1.040833        -0.056822 -1.006689
..         ...             ...              ...              ...       ...
595   0.807075       -1.390432         0.960769        -1.274445  0.993355
596   0.563672       -1.071672         0.960769        -1.274445  0.993355
597  -0.300744        0.909696        -1.040833        -1.274445  0.993355
598   1.656940        1.432197         0.960769        -0.056822 -1.006689
599   1.577766        0.991590        -1.040833        -1.274445 -1.006689

[600 rows x 5 columns]

In [233]:
#Data Division
X = df_new_dataframe3.iloc[:,0:4]
Y = df_new_col

In [234]:
#Data Partition 
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size =0.3,random_state =82)

In [235]:
print(X_train.shape,X_test.shape,Y_train.shape,Y_test.shape)

(420, 4) (180, 4) (420, 1) (180, 1)

In [236]:
#Data Model
from sklearn import tree
DTC = tree.DecisionTreeClassifier(criterion = 'gini')
DTC.fit(X_train,Y_train)

DecisionTreeClassifier()

In [238]:
Y_pred_train = DTR.predict(X_train)
Y_pred_test = DTR.predict(X_test)

In [239]:
from sklearn.metrics import accuracy_score
print('Training Score',accuracy_score(Y_pred_train,Y_train))
print('Testing Score',accuracy_score(Y_pred_test,Y_test))

Training Score 1.0
Testing Score 1.0

In [246]:
from sklearn.model_selection import KFold,cross_val_score
K = KFold(20)
result = cross_val_score(DTR,X,Y,cv = K)
print(np.mean(result))

0.9983333333333334

In [ ]:
#for Doing Descision tree  i got high accuarcy and also did the k-fold cross validation also got the same accuracy.So it is best suit for descision tree classifier..